//Семинар #4
//https://acmp.ru/asp/do/index.asp?main=task&id_course=1&id_section=6&id_topic=117&id_problem=723
//Известно, что любое чётное число, большее 2, представимо в виде суммы 2 простых чисел, причём таких разложений может быть несколько.
//Впервые гипотезу о существовании данного разложения сформулировал математик Х. Гольдбах.
//Требуется написать программу, производящую согласно утверждению Гольдбаха, разложение заданного чётного числа.
//Из всех пар простых чисел, сумма которых равна заданному числу, требуется найти пару, содержащую наименьшее простое число.
//Входные данные
//Входной файл INPUT.TXT содержит чётное число N (4 ≤ N ≤ 998).
//Выходные данныеВ выходной файл OUTPUT.TXT необходимо вывести два простых числа, сумма которых равна числу N.
//Первым выводится наименьшее число.


namespace hw_04_Goldbakh
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}